DavidPonce-dev/ChIoT/firmware/sdkconfig.defaults
CONFIG_ESPTOOLPY_FLASHSIZE="2MB"
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/huge_app.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions/huge_app.csv"
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_BOOTLOADER_WDT_TIME_MS=9000
CONFIG_PARTITION_TABLE_CUSTOM_APP_BIN_OFFSET=0x10000
CONFIG_APP_BUILD_TYPE_APP_2NDBOOT=y
CONFIG_ARDUINO_VARIANT="esp32dev"
